{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋Hello there, I'm Niles, and I'm excited to share a bit about my journey and diverse background. With a career as a Senior Systems Engineer, I've achieved a lot in the ever-evolving world of technology. Transitioning into Software Development has been a proud achievement, and I'm thrilled about the endless possibilities in this domain. My experience spans across various facets of Information Technology, from Software as a Service (SAAS) to Infrastructure as a Service (IAAS), as well as managing physical infrastructure and mastering network technologies. I've seamlessly integrated Agile methodologies into my work, enhancing adaptability and project efficiency. Proficiency in HTML, JavaScript, and Python has been vital in my transition, and I'm dedicated to expanding my horizons in this field. Holding degrees in Network Systems Administration and Network Communications Management showcases my commitment to lifelong learning. Recently, I completed the Full Stack Software Development Boot Camp at Code Fellows and I'm currently pursuing my masters in web and mobile app development at DeVry University. Outside of work, I value a healthy work-life balance. Spending quality time with my son and three dogs, enjoying cinema and music, and indulging in gaming all contribute to this balance. My professional reputation is built on a commitment to collaboration, a people-centric ethos, and a deep sense of compassion. These qualities have enriched my critical thinking and honed my management capabilities. In today's world, where technology is the backbone of modern society, my passion for innovation and commitment to excellence are the driving forces behind my journey. I'm eager to connect, share, and continue learning within this vast realm of knowledge and possibility.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Bark Buddies",
        "startDate": "2023",
        "description": "Bark Buddies is a passion project of mine that aims to connect dog owners and their furry companions for shared playtime. The app allows dog owners to create detailed profiles for their pets and uses a sophisticated algorithm to match them with similar dogs in their local area. With the goal of expanding this project into a comprehensive full-stack app, I am pouring my heart into its development. As a devoted owner of three dogs myself, I am currently focused on enhancing the user experience with a new mobile app version.",
        
        "images": [
          "images/portfolio/bark-buddies/p1.PNG",
          "images/portfolio/bark-buddies/p2.PNG",
          "images/portfolio/bark-buddies/p3.PNG"
          ],
        "url": "https://bark-buddies.github.io/Bark-Buddies/form.html",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML5"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          }
        ]
      },
      {
        "title": "File Organizer Pro",
        "startDate": "2024",
        "description": "File Organizer Pro is a Python-based personal project of mine designed to help with file management and organization on a PC. The program has dependencies such as tkinter, numpy, fitz, io, os, shutil, and zipfile. It allows users to browse folders on their computer using Windows Explorer integration, displaying files in alphanumeric order with their sizes. Users can perform various actions such as renaming, copying, moving, and searching for files anywhere on the PC, as well as zipping files. Additionally, the program provides real-time monitoring of system resources, including CPU, memory, disk, and network usage, through graphical charts and detailed lists. Users can easily see where the system usage is coming from and monitor inbound and outbound network traffic.",
        "images": [
          "images/portfolio/fileOrgPro/p1.PNG",
          "images/portfolio/fileOrgPro/p2.PNG",
          "images/portfolio/fileOrgPro/p3.PNG",
          "images/portfolio/fileOrgPro/p4.PNG"
        ],
        "url": "https://github.com/Niles086/file-cleaner",
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          }
          
        ]
      },
      {
        "title": "Coco Diamonds LLC",
        "startDate": "2024",
        "description": "Working with Coco Diamonds LLC was an incredibly rewarding experience and marked my first professional project for a company. Collaborating with the CEO of this startup allowed me to help bring their dream to life. Coco Diamonds is an Atlanta-based company that specializes in producing an organic skincare line. I was responsible for handling all aspects of graphic design, web development, and graphical editing for the entire company. Additionally, I set up payment processing and inventory management systems, effectively establishing the groundwork for their successful online e-commerce store.",
        "images": [
          "images/portfolio/cocoD/p1.PNG",
          "images/portfolio/cocoD/p2.PNG",
          "images/portfolio/cocoD/p3.PNG"
        ],
        "url": "coco-diamonds.com",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML5"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Cutter & Buck",
        "title": "Senior Systems Engineer",
        "years": "02-2023 - 09-2023",
        "mainTech": [
          "vSphere 8.0"
        ],
        "technologies": [
          "Meraki",
          "Azure",
          "AWS",
          "Office 365",
          "SQL Server",
          "VMware",
          "vSphere",
          "PowerCLI",
          "PowerShell",
          "vRealize",
          "vCenter",
          "vCenter Server",
          "Veeam",
          "Active Directory",
          "Data Center Management"

        
        ]
      },
      {
        "company": "Syneren Technologies",
        "title": "Senior Systems Engineer",
        "years": "12 -2021 - 01 - 2023",
        "mainTech": [
          "Windows Server"
        ],
        "technologies": [
          "Meraki",
          "Azure",
          "AWS",
          "Office 365",
          "Active Directory",
          "Veeam",
          "Hyper-V",
          "PowerCLI",
          "Data Center Management",
          "IIS",
          "Apache",
          "MySQL",
          "SQL Server",
          "PowerShell"
        ]
      }
    ]
  }
