{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋Greetings, I'm Niles, and I'm thrilled to share a bit more about my journey and diverse background. As a Senior Systems Engineer, my career has been a tapestry of achievements in the dynamic world of technology. I take pride in being an emerging Software Developer and am particularly excited about my venture into this ever-evolving domain. Over the years, I've honed my skills across various facets of Information Technology, from Software as a Service (SAAS) to Infrastructure as a Service (IAAS), managing physical infrastructure, and mastering an array of network technologies. The application of Agile methodologies has seamlessly integrated into my work, allowing for enhanced adaptability and efficiency in projects. My proficiency in HTML, JavaScript, and Python has been instrumental in my transition into Software Development, and I'm committed to continually expanding my horizons in this field. I hold degrees in Network Systems Administration from the New York Institute of Technology and Network Communications Management from DeVry University, showcasing my dedication to lifelong learning. At present, I'm furthering my expertise as a student at Code Fellows, participating in their Full Stack Software Development Boot Camp.Beyond my professional endeavors, I'm a firm believer in work-life balance. I cherish quality time spent with my son and two dogs, relish the world of cinema and music, and occasionally find myself immersed in the realm of gaming. My professional reputation is built on a commitment to collaboration, a people-centric ethos, and a deep sense of compassion. These qualities have not only enriched my critical thinking but have also honed my management capabilities. In a world where technology is the backbone of modern society, my passion for innovation and commitment to excellence are the driving forces behind my journey. I'm excited to connect, share, and learn within this vast realm of knowledge and possibility.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Bark Buddies",
        "startDate": "2023",
        "description": "Personal project. I was responsible for working on it with my group for our code-201 final project. It is an app that allows owners to make a profile for their dog and our algorithm matches similar dogs in your area so you can setup a play date. I want to carry this project forward and create a fullstack app using react, node, and mongoDB.",
        
        "images": [
          "images/portfolio/bark-buddies/p1.PNG",
          "images/portfolio/bark-buddies/p2.PNG",
          "images/portfolio/bark-buddies/p3.PNG"
          ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML5"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          }
        ]
      },
      {
        "title": "Photography",
        "startDate": "2018",
        "description": "Personal project for study subject. I was responsible for testing photography application that optimizes images with popular algorithms used by graphic editors like Pixlr or Adobe Photoshop. I've earned A grade :)",
        "images": [
          "images/portfolio/photography/p1.jpg",
          "images/portfolio/photography/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "3D Object Viewer",
        "startDate": "2015",
        "description": "One of the first apps I was working on my internship. I had to develop front-end implementation for app that shows 3D models of known buildings. This was also my first project in Angular framework. I've learned a lot!",
        "images": [
          "images/portfolio/adventure/p1.jpg",
          "images/portfolio/adventure/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "DefOpenSource",
        "title": "Front-End Developer",
        "years": "10.2019 - present",
        "mainTech": [
          "Angular 8/9/10"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "EF Core",
          ".NET Core",
          "SignalR",
          "Angular Material"
        ]
      },
      {
        "company": "Serros Solutions",
        "title": "Intern",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt"
        ]
      }
    ]
  }
